sendu2wfdx/RemoteBSP/firmware/boards/stm32g431cbu6/main.c
static void fatal_error(void) {
    __disable_irq();
    for (;;) {
    }
}

#ifdef CONFIG_APP_LAYOUT_KATAPULT_8K
static void board_enter_bootloader(rbsp_bootloader_mode_t mode) {
    static const uint64_t can_request_signature =
        UINT64_C(0x5984E3FA6CA1589B);
    static const uint64_t usb_request_signature =
        UINT64_C(0x8F3D6A21C457B09E);
    const uint64_t request_signature =
        mode == RBSP_BOOTLOADER_USB
            ? usb_request_signature : can_request_signature;
    const uint32_t signature_address =
        *(const volatile uint32_t*)FLASH_BASE;
    const uint32_t ram_begin = SRAM_BASE;
    const uint32_t ram_end = SRAM_BASE + (32U * 1024U);
    if ((signature_address & 7U) != 0U ||
        signature_address < ram_begin ||
        signature_address > ram_end - sizeof(request_signature)) {
        fatal_error();
    }
    __disable_irq();
    *(volatile uint64_t*)(uintptr_t)signature_address =
        request_signature;
    __DSB();
    __ISB();
    NVIC_SystemReset();
    for (;;) {
    }
}
#endif

static void system_clock_configure(void) {
    RCC_OscInitTypeDef oscillator = {0};
    RCC_ClkInitTypeDef clock = {0};

    if (HAL_PWREx_ControlVoltageScaling(
            PWR_REGULATOR_VOLTAGE_SCALE1_BOOST) != HAL_OK) {
        fatal_error();
    }

    oscillator.OscillatorType =
#ifdef CONFIG_G431_CLOCK_HSE_8MHZ
        RCC_OSCILLATORTYPE_HSE;
#else
        RCC_OSCILLATORTYPE_HSI;
#endif
#ifdef CONFIG_REMOTEBSP_TRANSPORT_USB
    oscillator.OscillatorType |= RCC_OSCILLATORTYPE_HSI48;
    oscillator.HSI48State = RCC_HSI48_ON;
#endif
#ifdef CONFIG_G431_CLOCK_HSE_8MHZ
    oscillator.HSEState = RCC_HSE_ON;
#else
    oscillator.HSIState = RCC_HSI_ON;
    oscillator.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
#endif
    oscillator.PLL.PLLState = RCC_PLL_ON;
#ifdef CONFIG_G431_CLOCK_HSE_8MHZ
    oscillator.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    oscillator.PLL.PLLM = RCC_PLLM_DIV2;
#else
    oscillator.PLL.PLLSource = RCC_PLLSOURCE_HSI;
    oscillator.PLL.PLLM = RCC_PLLM_DIV4;
#endif
    oscillator.PLL.PLLN = 85U;
    oscillator.PLL.PLLP = RCC_PLLP_DIV2;
    oscillator.PLL.PLLQ = RCC_PLLQ_DIV2;
    oscillator.PLL.PLLR = RCC_PLLR_DIV2;
    if (HAL_RCC_OscConfig(&oscillator) != HAL_OK) {
        fatal_error();
    }

    clock.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                      RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    clock.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    clock.AHBCLKDivider = RCC_SYSCLK_DIV1;
    clock.APB1CLKDivider = RCC_HCLK_DIV1;
    clock.APB2CLKDivider = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&clock, FLASH_LATENCY_4) != HAL_OK) {
        fatal_error();
    }

    RCC_PeriphCLKInitTypeDef peripheral_clock = {0};
#ifdef CONFIG_REMOTEBSP_TRANSPORT_CAN
    peripheral_clock.PeriphClockSelection = RCC_PERIPHCLK_FDCAN;
    peripheral_clock.FdcanClockSelection = RCC_FDCANCLKSOURCE_PCLK1;
#else
    peripheral_clock.PeriphClockSelection = RCC_PERIPHCLK_USB;
    peripheral_clock.UsbClockSelection = RCC_USBCLKSOURCE_HSI48;
#endif
    if (HAL_RCCEx_PeriphCLKConfig(&peripheral_clock) != HAL_OK) {
        fatal_error();
    }
#ifdef CONFIG_REMOTEBSP_TRANSPORT_USB
    __HAL_RCC_CRS_CLK_ENABLE();
    RCC_CRSInitTypeDef crs = {0};
    crs.Prescaler = RCC_CRS_SYNC_DIV1;
    crs.Source = RCC_CRS_SYNC_SOURCE_USB;
    crs.Polarity = RCC_CRS_SYNC_POLARITY_RISING;
    crs.ReloadValue =
        __HAL_RCC_CRS_RELOADVALUE_CALCULATE(48000000U, 1000U);
    crs.ErrorLimitValue = RCC_CRS_ERRORLIMIT_DEFAULT;
    crs.HSI48CalibrationValue = RCC_CRS_HSI48CALIBRATION_DEFAULT;
    HAL_RCCEx_CRSConfig(&crs);
#endif
}

static GPIO_TypeDef* gpio_port_from_index(uint8_t index) {
    if (index == 0U) {
        return GPIOA;
    }
    if (index == 1U) {
        return GPIOB;
    }
    if (index == 2U) {
        return GPIOC;
    }
    return NULL;
}

static void enable_gpio_clock(uint8_t index) {
    if (index == 0U) {
        __HAL_RCC_GPIOA_CLK_ENABLE();
    } else if (index == 1U) {
        __HAL_RCC_GPIOB_CLK_ENABLE();
    } else if (index == 2U) {
        __HAL_RCC_GPIOC_CLK_ENABLE();
    }
}

static bool gpio_pin_present(uint16_t encoded_pin) {
    const uint8_t port = (uint8_t)(encoded_pin / 16U);
    const uint8_t pin = (uint8_t)(encoded_pin % 16U);
    /* WeAct QFN48 实际引出完整 GPIOA/GPIOB，以及 PC4/PC6/PC10/PC11/PC13。 */
    if (port > 2U) {
        return false;
    }
    if (port == 2U && pin != 4U && pin != 6U && pin != 10U &&
        pin != 11U && pin != 13U) {
        return false;
    }
    if (port == 0U && (pin == 13U || pin == 14U)) {
        return false;
    }
#if defined(CONFIG_REMOTEBSP_TRANSPORT_USB)
    if (port == 0U && (pin == 11U || pin == 12U)) {
        return false;
    }
#elif defined(CONFIG_CAN_PINS_PA11_PA12)
    if (port == 0U && (pin == 11U || pin == 12U)) {
        return false;
    }
#else
    if (port == 1U && (pin == 8U || pin == 9U)) {
        return false;
    }
#endif
#ifdef CONFIG_CAN_TRANSCEIVER_STB_ENABLE
    static const char stb_port[] = CONFIG_CAN_TRANSCEIVER_STB_PORT;
    const uint8_t stb_port_index =
        (uint8_t)(stb_port[0] - 'A');
    if (port == stb_port_index &&
        pin == CONFIG_CAN_TRANSCEIVER_STB_PIN) {
        return false;
    }
#endif
    return true;
}

static bool gpio_pin_reserved_by_board(uint16_t encoded_pin) {
#ifdef CONFIG_WEACT_G431_PC6_PWM_BREATHING_LED
    return encoded_pin == (2U * 16U + 6U);
#else
    (void)encoded_pin;
    return false;
#endif
}

#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
static bool soft_uart_pin_reserved(uint16_t encoded_pin);
static bool soft_uart_configuration_valid(bool used[64]);
#endif

#ifdef CONFIG_REMOTEBSP_MOTION
static bool motion_pin_reserved(uint16_t encoded_pin) {
    for (uint8_t axis = 0U; axis < active_motion_axis_count; ++axis) {
        const rbsp_runtime_motion_axis_config_t* const config =
            &active_motion_axes[axis];
        if (config->step_pin == encoded_pin ||
            config->direction_pin == encoded_pin ||
            (config->enable_present && config->enable_pin == encoded_pin) ||
            config->limit_pin == encoded_pin) {
            return true;
        }
    }
    return false;
}
#endif

#if defined(CONFIG_REMOTEBSP_MOTION) || \
    defined(CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART)
static bool motion_slot_configuration_valid(void) {
    bool used[64] = {false};
#ifdef CONFIG_REMOTEBSP_MOTION
    bool enable_used[64] = {false};
    bool enable_active_low[64] = {false};
    for (uint8_t axis = 0U; axis < MOTION_SLOT_AXIS_COUNT; ++axis) {
        const motion_axis_pins_t* const pins = &motion_axis_pins[axis];
        const uint16_t values[] = {
            (uint16_t)(pins->step.port * 16U + pins->step.pin),
            (uint16_t)(pins->direction.port * 16U + pins->direction.pin),
        };
        for (uint8_t index = 0U; index < 2U; ++index) {
            if (values[index] >= 64U || used[values[index]] ||
                !gpio_pin_present(values[index]) ||
                gpio_pin_reserved_by_board(values[index])) {
                return false;
            }
            used[values[index]] = true;
        }
        const uint16_t enable = (uint16_t)(
            pins->enable.port * 16U + pins->enable.pin);
        if (enable >= 64U || !gpio_pin_present(enable) ||
            gpio_pin_reserved_by_board(enable) ||
            (used[enable] && !enable_used[enable]) ||
            (enable_used[enable] &&
             enable_active_low[enable] != pins->enable_active_low)) {
            return false;
        }
        used[enable] = true;
        enable_used[enable] = true;
        enable_active_low[enable] = pins->enable_active_low;
    }
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    if (!soft_uart_configuration_valid(used)) {
        return false;
    }
#endif
    return true;
}
#endif

static bool gpio_pin_allowed(uint16_t encoded_pin) {
    if (!gpio_pin_present(encoded_pin) ||
        gpio_pin_reserved_by_board(encoded_pin)) {
        return false;
    }
#ifdef CONFIG_REMOTEBSP_MOTION
    if (motion_pin_reserved(encoded_pin)) {
        return false;
    }
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    if (soft_uart_pin_reserved(encoded_pin)) {
        return false;
    }
#endif
    return true;
}


#ifdef CONFIG_REMOTEBSP_TRANSPORT_CAN
static void transceiver_enable(void) {
#ifdef CONFIG_CAN_TRANSCEIVER_STB_ENABLE
    static const char stb_port_name[] =
        CONFIG_CAN_TRANSCEIVER_STB_PORT;
    if (stb_port_name[0] < 'A' || stb_port_name[0] > 'C' ||
        CONFIG_CAN_TRANSCEIVER_STB_PIN > 15) {
        fatal_error();
    }
    const uint8_t port_index =
        (uint8_t)(stb_port_name[0] - 'A');
    GPIO_TypeDef* port = gpio_port_from_index(port_index);
    enable_gpio_clock(port_index);
    HAL_GPIO_WritePin(
        port, (uint16_t)(1U << CONFIG_CAN_TRANSCEIVER_STB_PIN),
        GPIO_PIN_RESET);
    GPIO_InitTypeDef init = {0};
    init.Pin = (uint16_t)(1U << CONFIG_CAN_TRANSCEIVER_STB_PIN);
    init.Mode = GPIO_MODE_OUTPUT_PP;
    init.Pull = GPIO_NOPULL;
    init.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(port, &init);
#endif
}
#endif /* CONFIG_REMOTEBSP_TRANSPORT_CAN */

static bool board_startup_gpio_apply(
    uint16_t encoded_pin, rbsp_startup_gpio_mode_t mode) {
    /* 上电安全状态必须能预置板载 LED 和运动专用输出，但不能碰 CAN/SWD。 */
    if (!gpio_pin_present(encoded_pin)) {
        return false;
    }
    const uint8_t port_index = (uint8_t)(encoded_pin / 16U);
    const uint8_t pin_index = (uint8_t)(encoded_pin % 16U);
    GPIO_TypeDef* port = gpio_port_from_index(port_index);
    enable_gpio_clock(port_index);
    const bool output = mode == RBSP_STARTUP_GPIO_OUTPUT_LOW ||
                        mode == RBSP_STARTUP_GPIO_OUTPUT_HIGH;
    if (output) {
        HAL_GPIO_WritePin(
            port, (uint16_t)(1U << pin_index),
            mode == RBSP_STARTUP_GPIO_OUTPUT_HIGH
                ? GPIO_PIN_SET
                : GPIO_PIN_RESET);
    }
    GPIO_InitTypeDef init = {0};
    init.Pin = (uint16_t)(1U << pin_index);
    init.Mode = output ? GPIO_MODE_OUTPUT_PP : GPIO_MODE_INPUT;
    init.Pull = GPIO_NOPULL;
    if (mode == RBSP_STARTUP_GPIO_INPUT_PULLUP) {
        init.Pull = GPIO_PULLUP;
    } else if (mode == RBSP_STARTUP_GPIO_INPUT_PULLDOWN) {
        init.Pull = GPIO_PULLDOWN;
    } else if (!output && mode != RBSP_STARTUP_GPIO_INPUT_FLOATING) {
        return false;
    }
    init.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(port, &init);
    return true;
}

static void startup_gpio_configure(void) {
    if (!rbsp_startup_gpio_apply(
            CONFIG_STARTUP_GPIO_OUTPUT_LOW,
            CONFIG_STARTUP_GPIO_OUTPUT_HIGH,
            CONFIG_STARTUP_GPIO_INPUT_FLOATING,
            CONFIG_STARTUP_GPIO_INPUT_PULLUP,
            CONFIG_STARTUP_GPIO_INPUT_PULLDOWN,
            board_startup_gpio_apply)) {
        fatal_error();
    }
}

