sendu2wfdx/RemoteBSP/firmware/boards/stm32g431cbu6/main.c
static bool board_motion_set_direction(uint8_t axis, bool positive) {
    if (axis >= active_motion_axis_count) {
        return false;
    }
    const rbsp_runtime_motion_axis_config_t* const config =
        &active_motion_axes[axis];
    motion_write_pin(motion_decode_pin(config->direction_pin),
                     positive != config->direction_inverted);
    return true;
}

static bool board_motion_set_step(uint8_t axis, bool high) {
    if (axis >= active_motion_axis_count) {
        return false;
    }
    motion_write_pin(
        motion_decode_pin(active_motion_axes[axis].step_pin), high);
    return true;
}

static bool board_motion_limit_active(uint8_t axis, bool* active) {
    if (axis >= active_motion_axis_count || active == NULL) {
        return false;
    }
    const rbsp_runtime_motion_axis_config_t* const config =
        &active_motion_axes[axis];
    if (config->limit_pin == UINT16_MAX) {
        *active = false;
        return true;
    }
    const motion_pin_t pin = motion_decode_pin(config->limit_pin);
    GPIO_TypeDef* const gpio = gpio_port_from_index(pin.port);
    const bool high = (gpio->IDR & (uint16_t)(1U << pin.pin)) != 0U;
    *active = config->limit_active_low ? !high : high;
    return true;
}

/* TIM2 以 1MHz 自由运行，结合溢出中断构成单调的 64 位运动时钟。 */
static void motion_timebase_configure(void) {
    __HAL_RCC_TIM2_CLK_ENABLE();
    TIM2->CR1 = 0U;
    TIM2->PSC = 169U;
    TIM2->ARR = UINT32_MAX;
    TIM2->EGR = TIM_EGR_UG;
    TIM2->CNT = 0U;
    TIM2->SR = 0U;
    TIM2->DIER = TIM_DIER_UIE;
    motion_timebase_epochs = 0U;
    HAL_NVIC_SetPriority(TIM2_IRQn, 0U, 0U);
    HAL_NVIC_EnableIRQ(TIM2_IRQn);
    TIM2->CR1 = TIM_CR1_CEN;
}

static uint64_t board_motion_nanoseconds(void) {
    uint32_t before;
    uint32_t after;
    uint32_t counter;
    do {
        before = motion_timebase_epochs;
        counter = TIM2->CNT;
        after = motion_timebase_epochs;
    } while (before != after);
    if ((TIM2->SR & TIM_SR_UIF) != 0U &&
        counter < UINT32_C(0x80000000)) {
        ++after;
    }
    return (((uint64_t)after << 32U) | counter) * 1000ULL;
}

/* TIM2_CH1 只在下一条运动边沿到期时触发，不再占用 TIM4。 */
static bool motion_schedule_compare(uint64_t deadline_ns) {
    uint64_t deadline_us = deadline_ns / 1000ULL;
    if ((deadline_ns % 1000ULL) != 0U && deadline_us != UINT64_MAX) {
        ++deadline_us;
    }
    const uint64_t now_us = board_motion_nanoseconds() / 1000ULL;
    uint64_t delta_us = deadline_us > now_us
                            ? deadline_us - now_us
                            : 0U;
    if (delta_us < CONFIG_MOTION_COMPARE_MIN_LEAD_US) {
        delta_us = CONFIG_MOTION_COMPARE_MIN_LEAD_US;
    }
    if (delta_us > INT32_MAX) {
        delta_us = INT32_MAX;
    }

    TIM2->DIER &= ~TIM_DIER_CC1IE;
    uint32_t target = TIM2->CNT + (uint32_t)delta_us;
    TIM2->CCR1 = target;
    TIM2->SR = ~TIM_SR_CC1IF;
    if ((int32_t)(target - TIM2->CNT) <
        (int32_t)CONFIG_MOTION_COMPARE_MIN_LEAD_US) {
        target = TIM2->CNT + CONFIG_MOTION_COMPARE_MIN_LEAD_US;
        TIM2->CCR1 = target;
        TIM2->SR = ~TIM_SR_CC1IF;
    }
    TIM2->DIER |= TIM_DIER_CC1IE;
    return true;
}

static void motion_cancel_compare(void) {
    TIM2->DIER &= ~TIM_DIER_CC1IE;
    TIM2->SR = ~TIM_SR_CC1IF;
}

static uint32_t motion_enter_critical(void) {
    const uint32_t state = __get_PRIMASK();
    __disable_irq();
    __DMB();
    return state;
}

static void motion_exit_critical(uint32_t state) {
    __DMB();
    if (state == 0U) {
        __enable_irq();
    }
}
#endif

#ifdef CONFIG_REMOTEBSP_TRANSPORT_CAN
void HAL_FDCAN_MspInit(FDCAN_HandleTypeDef* handle) {
    if (handle->Instance != FDCAN1) {
        return;
    }
    __HAL_RCC_FDCAN_CLK_ENABLE();
    GPIO_InitTypeDef init = {0};
    init.Mode = GPIO_MODE_AF_PP;
    init.Pull = GPIO_NOPULL;
    init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    init.Alternate = GPIO_AF9_FDCAN1;
#if defined(CONFIG_CAN_PINS_PA11_PA12)
    __HAL_RCC_GPIOA_CLK_ENABLE();
    init.Pin = GPIO_PIN_11 | GPIO_PIN_12;
    HAL_GPIO_Init(GPIOA, &init);
#else
    __HAL_RCC_GPIOB_CLK_ENABLE();
    init.Pin = GPIO_PIN_8 | GPIO_PIN_9;
    HAL_GPIO_Init(GPIOB, &init);
#endif
}

static void fdcan_configure(void) {
    fdcan_handle.Instance = FDCAN1;
#ifdef CONFIG_CAN_FD_ENABLE
    fdcan_handle.Init.FrameFormat = FDCAN_FRAME_FD_BRS;
#else
    fdcan_handle.Init.FrameFormat = FDCAN_FRAME_CLASSIC;
#endif
    fdcan_handle.Init.Mode = FDCAN_MODE_NORMAL;
    fdcan_handle.Init.AutoRetransmission = ENABLE;
    fdcan_handle.Init.TransmitPause = DISABLE;
    fdcan_handle.Init.ProtocolException = ENABLE;
    fdcan_handle.Init.NominalPrescaler = FDCAN_NOMINAL_PRESCALER;
    /* 34 TQ，采样点为 (1 + 29) / 34 = 88.24%，与常见 USB-CAN 的 87.5% 对齐。 */
    fdcan_handle.Init.NominalSyncJumpWidth = 4U;
    fdcan_handle.Init.NominalTimeSeg1 = 29U;
    fdcan_handle.Init.NominalTimeSeg2 = 4U;
    fdcan_handle.Init.DataPrescaler = FDCAN_DATA_PRESCALER;
    fdcan_handle.Init.DataSyncJumpWidth = 3U;
    fdcan_handle.Init.DataTimeSeg1 = 13U;
    fdcan_handle.Init.DataTimeSeg2 = 3U;
    fdcan_handle.Init.StdFiltersNbr = 1U;
    fdcan_handle.Init.ExtFiltersNbr = 0U;
    fdcan_handle.Init.TxFifoQueueMode = FDCAN_TX_FIFO_OPERATION;
    if (HAL_FDCAN_Init(&fdcan_handle) != HAL_OK) {
        fatal_error();
    }

    FDCAN_FilterTypeDef filter = {0};
    filter.IdType = FDCAN_STANDARD_ID;
    filter.FilterIndex = 0U;
    filter.FilterType = FDCAN_FILTER_MASK;
    filter.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
    filter.FilterID1 = 0U;
    filter.FilterID2 = 0U;
    if (HAL_FDCAN_ConfigFilter(&fdcan_handle, &filter) != HAL_OK ||
        HAL_FDCAN_ConfigGlobalFilter(
            &fdcan_handle, FDCAN_REJECT, FDCAN_REJECT,
            FDCAN_REJECT_REMOTE, FDCAN_REJECT_REMOTE) != HAL_OK ||
        HAL_FDCAN_Start(&fdcan_handle) != HAL_OK) {
        fatal_error();
    }
}

static uint32_t fdcan_dlc_from_length(uint8_t length) {
    static const uint32_t dlc[] = {
        FDCAN_DLC_BYTES_0, FDCAN_DLC_BYTES_1, FDCAN_DLC_BYTES_2,
        FDCAN_DLC_BYTES_3, FDCAN_DLC_BYTES_4, FDCAN_DLC_BYTES_5,
        FDCAN_DLC_BYTES_6, FDCAN_DLC_BYTES_7, FDCAN_DLC_BYTES_8};
    if (length <= 8U) {
        return dlc[length];
    }
    switch (length) {
        case 12U:
            return FDCAN_DLC_BYTES_12;
        case 16U:
            return FDCAN_DLC_BYTES_16;
        case 20U:
            return FDCAN_DLC_BYTES_20;
        case 24U:
            return FDCAN_DLC_BYTES_24;
        case 32U:
            return FDCAN_DLC_BYTES_32;
        case 48U:
            return FDCAN_DLC_BYTES_48;
        case 64U:
            return FDCAN_DLC_BYTES_64;
        default:
            return UINT32_MAX;
    }
}

